translations = {
    "new_user_start_message": "សូមស្វាគមន៍មកកាន់Bot! អ្នកអាចប្រើប្រាស់វាបានឥឡូវនេះ",
    "welcome_old_user": "សូមស្វាគមន៍,",
    "greeting_old_user": "រីករាយដែលបានជួបអ្នកម្ដងទៀត!",
    "choose_language": "សូមជ្រើសរើសភាសារបស់អ្នក៖",
    "help_command": "មកដល់ឆាប់ៗនេះ",
    "pending_user": "គណនីរបស់អ្នកកំពុងរងចាំការអនុម័ត, សូមទាក់ទងអ្នកគ្រប់គ្រងដើម្បីអនុម័ត។",
    "inactive_user": "គណនីរបស់អ្នកត្រូវបានផ្អាក។ សូមទាក់ទងអ្នកគ្រប់គ្រង។",
    "language_command": "ផ្លាស់ប្ដូរភាសា",
    "share_contact_command": "ចែករំលែកព័ត៌មានទំនាក់ទំនង",
    "start_command": "ចាប់ផ្ដើមប្រើ Bot",
    "fire_menu": "ជូនដំណឹងទៅសេវាអគ្គិភ័យ",
    "police_menu": "ជូនដំណឹងទៅនគរបាល",
    "ambulance_menu": "ជូនដំណឹងទៅសេវាសង្គ្រោះបន្ទាន់",
    "rule_menu": "ចូលទៅមើលគោលការណ៍",
    "amg_command": """
Bot ជំនួយបន្ទាន់នេះត្រូវបានរចនាឡើងសម្រាប់ជួយអ្នករាយការណ៍អំពីស្ថានការណ៍បន្ទាន់ពិតប្រាកដដូចជា៖

🚓 នគរបាល
🚑 ឡានសង្គ្រោះបន្ទាន់
🔥 ភ្លើងឆេះ
🆘 ករណីបន្ទាន់ផ្សេងទៀត

⚠️ សូមអានយ៉ាងប្រុងប្រយ័ត្នមុននឹងប្រើប្រាស់។

🔄 របៀបប្រើប្រាស់

🛠 សាកល្បង (ចូលមកដំបូង)
អ្នកអាចសាកល្បងលក្ខណៈពិសេសទាំងអស់បានដោយសុវត្ថិភាព។
មិនមានការជូនដំណឹងពិតប្រាកដត្រូវបានផ្ញើទេ។
សុវត្ថិភាពសម្រាប់សិក្សាពីរបៀបដំណើរការរបស់ Bot។

🚨 ពិតប្រាកដ
សកម្មភាពទាំងអស់នឹងត្រូវបានចាត់ទុកថាជាស្ថានការណ៍បន្ទាន់។
ការរាយការណ៍នឹងត្រូវផ្ញើទៅកាន់សេវាបន្ទាន់នានាពិតប្រាកដ។
កុំប្រើប្រាស់ដើម្បីលេងសើច។

🔘 បើក / បិទ
ចុច "បើក" ដើម្បីចូលរបៀបបន្ទាន់ពិតប្រាកដ
ចុច "បិទ" ដើម្បីត្រលប់ទៅរបៀបសាកល្បង

❗ សូមមានការទទួលខុសត្រូវ។ ការប្រើប្រាស់មិនត្រឹមត្រូវអាចនាំឱ្យជាប់ទោស។
""",
    "inactive_buttons_message": """
អ្នកកំពុងនៅក្នុងការសាកល្បង។

🛠️ អ្នកអាចសាកល្បងលក្ខណៈពិសេសទាំងអស់ដោយសុវត្ថិភាព។
📵 មិនមានការរាយការណ៍ពិតប្រាកដត្រូវបានផ្ញើទៅសេវាបន្ទាន់ទេ។

⚠️ ចងចាំបើករបៀបបន្ទាន់ពិតប្រាកដនៅពេលមានស្ថានការណ៍បន្ទាន់។
""",
    "active_buttons_message": """
អ្នកកំពុងនៅក្នុងរបៀបបន្ទាន់ពិតប្រាកដ។

☎️ រាយការណ៍ទាំងអស់របស់អ្នកនឹងត្រូវផ្ញើទៅសេវាបន្ទាន់។
❗️ កុំប្រើរបៀបនេះសម្រាប់សំណើច ឬការសាកល្បង។

🆘 ការប្រើប្រាស់មិនត្រឹមត្រូវអាចនាំឱ្យជាប់ទោស ឬត្រូវបានហាមឃាត់។ 
សូមបន្តប្រសិនបើអ្នកជួបបញ្ហាបន្ទាន់ពិតប្រាកដ។
""",
    "Activate_message": """ 
🔓 បានបើករបៀបបន្ទាន់ពិតប្រាកដ។ អ្នកកំពុងនៅក្នុងរបៀបបន្ទាន់ពិតប្រាកដ។

☎️ រាយការណ៍ទាំងអស់របស់អ្នកនឹងត្រូវផ្ញើទៅសេវាបន្ទាន់។
❗ កុំប្រើរបៀបលេងសើច ឬសាកល្បង។

🆘 ការប្រើប្រាស់មិនត្រឹមត្រូវអាចនាំឱ្យជាប់ទោស ឬត្រូវបានហាមឃាត់។ 
សូមបន្តប្រសិនបើអ្នកជួបបញ្ហាបន្ទាន់ពិតប្រាកដ។
""",
    "Inactivate_message": """
🔒 បានបើករបៀបសាកល្បង។ អ្នកកំពុងស្ថិតក្នុងរបៀបសាកល្បង។

🛠️ អ្នកអាចសាកល្បងលក្ខណៈពិសេសទាំងអស់ដោយសុវត្ថិភាព។
📵 មិនមានការរាយការណ៍ត្រូវបានផ្ញើទៅសេវាបន្ទាន់ទេ។

⚠️ ចងចាំបើករបៀបបន្ទាន់ពិតប្រាកដនៅពេលមានស្ថានការណ៍បន្ទាន់។
""",
    "fire_command": """🔥 ករណីអគ្គិភ័យ សូមផ្ញើទីតាំងរបស់អ្នក ដើម្បីក្រុមពន្លត់អគគិភ័យអាចទៅដល់បានយ៉ាងឆាប់រហ័ស។""",
    "police_command": """👮 ករណីបន្ទាន់សម្រាប់នគរបាល សូមផ្ញើទីតាំងរបស់អ្នក ដើម្បីក្រុមនគរបាលអាចទៅដល់បានយ៉ាងឆាប់រហ័ស។""",
    "ambulance_command": """🚑 ករណីបន្ទាន់សម្រាប់សេវាសង្គ្រោះបន្ទាន់ សូមផ្ញើទីតាំងរបស់អ្នក ដើម្បីឡានសង្គ្រោះអាចទៅដល់បានយ៉ាងឆាប់រហ័ស។""",
    "other_command": """🆘 មកដល់ឆាប់ៗនេះ""",
    "fire_not_work_message": "🔥 សូមអភ័យទោស លក្ខណៈពិសេសអគ្គិភ័យមិនដំណើរការនៅឡើយទេ សូមព្យាយាមម្តងទៀត",
    "ambulance_not_work_message": "🚑 សូមអភ័យទោស លក្ខណៈពិសេសសង្គ្រោះបន្ទាន់មិនដំណើរការនៅឡើយទេ សូមព្យាយាមម្តងទៀត", 
    "police_not_work_message": "👮 សូមអភ័យទោស លក្ខណៈពិសេសនគរបាលមិនដំណើរការនៅឡើយទេ សូមព្យាយាមម្តងទៀត", 
    "not_live_location": "សូមផ្ញើទីតាំងបច្ចុប្បន្ន មិនមែន Live Location",
    "select_any_command_first": "សូមជ្រើសប្រភេទករណីបន្ទាន់ជាមុន ដោយចុចប៊ូតុង ឬមីនុយ។",
    "send_your_text": "សូមពិពណ៌នាអំពីអ្វីដែលកើតឡើង។",
    "send_location_first": "សូមផ្ញើទីតាំងរបស់អ្នកជាមុនសិន។",
    "send_your_photo": "សូមផ្ញើរូបភាព ឬវីដេអូ",
    "send_image_or_video_first": "សូមផ្ញើរូបភាព ឬវីដេអូជាមុនសិន",
    "success_submit": "✅ សូមអរគុណ។ របាយការណ៍របស់អ្នកត្រូវបានទទួល។ សេវាបន្ទាន់កំពុងមកដល់។"
}
